КАКерамика_моя_старая_база.QW_ОграничениеДоступа/src/Documents/ТаможеннаяДекларацияИмпорт/ТаможеннаяДекларацияИмпорт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="9ca75ff4-fa62-49dd-9655-4570cc73fdd9">
  <name>ТаможеннаяДекларацияИмпорт</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="202fbc40-4548-4fc6-962d-4d58e4387a74">
    <name>БанковскийСчетКонтрагента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="62cc691a-fa5d-4dca-9e46-4961f54c6752">
    <name>ТаможенныйШтраф</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="68e01da9-7b03-4553-b16f-02216a8783dd">
    <name>Поставщик</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b25fde06-20ae-4de1-b08b-2121791066f4">
    <name>КонтрагентПоставщика</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="95570c6c-cc3c-485e-839d-94f05e799d49">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="cf0e6096-8d8b-4180-9a65-b7b8c6c8bc49">
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="bf5f8a82-4f1e-429a-bb39-7f969b8d3771">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="18c89147-f775-4401-b1f4-561eb15ee34d">
    <name>НомерДекларации</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="9145a807-cbae-41d4-a776-54fe12a14c2b">
    <name>ОплатаЧерезЕдиныйЛицевойСчет</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3bcc067c-14c9-4495-9874-ae776fb98476">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1544208e-3cc3-46c7-a45d-a1f3b57aad81">
    <name>ВариантОформления</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a6e9df0b-4a70-47c6-96d1-68a1d25e3a1b">
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6624cb9e-95a3-499f-b7c2-6935948cdee1">
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f4b19deb-2428-4c9b-aad6-bec06534c63a">
    <name>Соглашение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6679b018-b900-4d48-9f7c-c9e9b9313c9f">
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d33ef3a3-0536-4fba-8b39-037573966f01">
    <name>ТаможенныйСбор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="70ccd0f1-4827-42cc-bc2c-ec3936252570">
    <name>СтатьяРасходовСбор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5f09fa31-968d-424f-8b23-7c33cb390884">
    <name>АналитикаРасходовСбор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1f424ba4-c819-4c30-ab59-b796f1e09cf8">
    <name>СтатьяРасходовШтраф</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="dc30eebb-6351-41c7-ac17-064ae183b6a7">
    <name>АналитикаРасходовШтраф</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="cbacabd2-e49b-42c0-97e4-2923f2248bf2">
    <name>ГруппаФинансовогоУчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b5928eed-8af5-4feb-ba2c-86dbf7c065a1">
    <name>Менеджер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3b30072a-f933-43a7-94d7-14673b9d17b8">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6553d3e3-ba58-4533-a011-9f47f143c04c">
    <name>ДатаПлатежа</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="ed2d57e8-c3d9-48a2-8baa-b399a88756cf">
    <name>ФормаОплаты</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="18116571-5a90-427f-b7e6-442282b005b7">
    <name>ПорядокРасчетов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3fb8bb7f-a17b-4da0-b86c-463c4d9b4648">
    <name>ВалютаВзаиморасчетов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3e1d1cbc-1c97-428c-86fb-b11d6eb0a7e3">
    <name>ПорядокОплаты</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9320a16b-fd72-4ae4-b40b-06283631ac4a">
    <name>УдалитьАналитикаУчетаПартий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4e33e25e-bc56-4b4b-8acc-04424eb69fce">
    <name>НаправлениеДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b976433f-0b49-475d-8c7d-8fdec5eff138">
    <name>БанковскийСчетОрганизации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="3f887654-645d-4c45-8940-b9f99f913140">
    <name>Разделы</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="4781138c-fb5e-4e34-ba97-813f0f446a0e">
      <name>Склад</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="c2824f02-f1f2-4238-90b0-26b9fea07ec5">
      <name>СтранаПроисхождения</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="0549258f-c947-490b-bcff-2539467ed3d8">
      <name>НомерРаздела</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>3</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="663881d2-033f-4c41-b567-cdacdb5a3cc3">
      <name>ТаможеннаяСтоимость</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="22b237d7-a27c-4841-b39e-68a8d44093d8">
      <name>СтавкаПошлины</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>6</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="289a77c5-2b65-4d42-b0d8-3c8a55c4f653">
      <name>СуммаПошлины</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="47ea0189-b9be-4ada-a254-9c5e3c651167">
      <name>СтавкаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="502ea462-7ec9-4605-a7e5-b3be293fb2c7">
      <name>СуммаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ОД_КодТНВЭД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОД_ВесНетто</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОД_ВесБрутто</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="604770dd-4f04-436f-8fcb-beff1a4f8e6f">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="04d1c7f5-e019-4df2-897c-97a28ee6575e">
      <name>КоличествоПоРНПТ</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>23</precision>
            <scale>11</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="12bb4df5-923c-4f72-8112-3193969769a0">
      <name>ДокументПоступления</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="f3805840-c040-40da-886b-2c8f8e68371e">
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="d2c995c3-34db-468a-aa77-65a98b38c1ae">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="157da5db-2cd5-49f7-8dca-3b69c127822c">
      <name>ВидЗапасов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="f2806c9b-cd5e-42ae-8307-43e338c8f834">
      <name>СуммаПошлины</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="1383ffb3-ffd1-46de-af3a-517dffaeb999">
      <name>НомерРаздела</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>3</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="fbafd281-49af-43bc-9d61-76744f0ed657">
      <name>ЗакупкаПодДеятельность</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="e847a029-c28a-4f0f-b901-1f37c93fb9f9">
      <name>Склад</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="51f3677c-1a57-42ec-ad07-35f809194f43">
      <name>УдалитьАналитикаУчетаПартий</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="1d98230b-2c85-4402-883d-e42af36b0f99">
      <name>ТаможеннаяСтоимость</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="ea8b0298-dfb7-4245-bc1f-f8d340d4e4ad">
      <name>НомерГТД</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="be2c2963-cfeb-4e51-9b0a-53de45ec1964">
      <name>СтранаПроисхождения</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="66cdf797-e97b-4c7f-b415-6600c8b1297f">
      <name>СуммаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="5f39e3a5-1214-4f66-81bb-9e31bfcb7777">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="25f3a6b6-1e1d-40c2-9223-f055c8253c7a">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="37e60c78-1599-49d3-96f7-e00ab3064f78">
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

КАКерамика_моя_старая_база.QW_ОграничениеДоступа/src/Documents/ТаможеннаяДекларацияИмпорт/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ОД_РаспределитьПоТНВЭДПослеНаСервере()

     ТЗ_Товары = Объект.Товары.Выгрузить();
	 ТЗ_Товары.Колонки.Добавить("КодТНВЭД", ОбщегоНазначения.ОписаниеТипаСтрока(20));
	 Для каждого Т Из ТЗ_Товары Цикл
		 Т.КодТНВЭД = Т.Номенклатура.КодТНВЭД;
	 КонецЦикла;
	 
	ТЗ_ТНВЭД = ТЗ_Товары.Скопировать();
	 
	ТЗ_ТНВЭД.Свернуть("КодТНВЭД");
	ТЗ_ТНВЭД.Сортировать("КодТНВЭД");
	
	Объект.Разделы.Очистить();
	
	НомерРаздела = 1;
	Для каждого Т Из ТЗ_ТНВЭД  Цикл
	
		НоваяСтрока = Объект.Разделы.Добавить();
		НоваяСтрока.НомерРаздела = НомерРаздела;
		
		ТаможеннаяСтоимость = 0;
		НайденныеСтроки = ТЗ_Товары.НайтиСтроки(Новый Структура("КодТНВЭД", Т.КодТНВЭД));
		Для каждого ТТ Из НайденныеСтроки Цикл
			ТаможеннаяСтоимость = ТаможеннаяСтоимость + ТТ.ТаможеннаяСтоимость;
			
			СтрокаТЧ = Объект.Товары.Получить(ТТ.НомерСтроки-1);
			СтрокаТЧ.НомерРаздела = НомерРаздела;
		КонецЦикла;
		
		НоваяСтрока.ТаможеннаяСтоимость = ТаможеннаяСтоимость;
		НоваяСтрока.ОД_КодТНВЭД = Т.КодТНВЭД;
		
		Если Объект.Дата >= '20260101' Тогда
			ЗначениеСсылка = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС22");
			Если ЗначениеСсылка = Неопределено Тогда
				НоваяСтрока.СтавкаНДС = Перечисления.СтавкиНДС.НДС20;
				НоваяСтрока.СуммаНДС = ТаможеннаяСтоимость * 0.20;
			Иначе
				НоваяСтрока.СтавкаНДС = Перечисления.СтавкиНДС.НДС22;
				НоваяСтрока.СуммаНДС = ТаможеннаяСтоимость * 0.22;
			КонецЕсли;
		Иначе
			НоваяСтрока.СтавкаНДС = Перечисления.СтавкиНДС.НДС20;
			НоваяСтрока.СуммаНДС = ТаможеннаяСтоимость * 0.20;
		КонецЕсли;
		
		
		НомерРаздела = НомерРаздела + 1;
	
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ОД_РаспределитьПоТНВЭДПосле(Команда)
	
	ОД_РаспределитьПоТНВЭДПослеНаСервере();
	
	Модифицированность = Истина;
	
КонецПроцедуры
